Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: A type that represents a globally-unique actor that can be used to isolate various declarations anywhere in the program.
ja: ある型、それはあるグローバルに特有なアクターを表します、それはさまざまな宣言をどこでもプログラムの中で分離するために使用できます。

source: A type that represents a position in the collection.
ja: コレクションの中のある位置を表す型。

source: A type that represents a position in the range.
ja: 範囲の中のある位置を表す型。

source: A type that represents a valid position in the collection.
ja: 有効な位置をそのコレクションにおいて表している型。

source: A type that represents an integer literal.
ja: ある整数リテラルを表す型。

source: A type that represents either a wrapped value or nil, the absence of a value.
ja: ラップされた値または、値の不在であるnil、どちらかを表すある型。

source: A type that represents the distance between two values.
ja: ２つの値の間の隔たりを表す型。

source: A type that represents the indices that are valid for subscripting the collection, in ascending order.
ja: 昇順での、コレクションの添え字として有効なインデックスを表す型。

source: A type that represents the words of this integer.
ja: この整数のワードを表す型。

source: A type that supplies a custom description for playground logging.
ja: プレイグラウンドログのためにあつらえの記述を提供する型。

source: A type that supplies the values of a sequence one at a time.
ja: あるシーケンスに属する値を一度に１つ提供する型。

source: A type used to format lists of items with a separator and conjunction appropriate for a given locale.
ja: 項目いくつかからなるリストをある与えられたロケールに適した区切りと接続詞で書式設定するために使われるある型。

source: A type with a customized textual representation suitable for debugging purposes.
ja: デバッグ目的に都合がよいようにカスタマイズされた原文の表現を持つ型。

source: A type with a customized textual representation.
ja: カスタマイズされた原文の表現を持つ型。

source: A type with values that support addition and subtraction.
ja: 加算と減算をサポートする値を持つ型。

source: A type with values that support multiplication.
ja: 乗算をサポートする値をもつ型。

source: A type-erased key path, from any root type to any resulting value type.
ja: 型消去キーパス、何らかの根本の型から何らかの結果値の型への。

source: A type’s size does not include any dynamically allocated or out of line storage.
ja: ある型のもつ大きさは、あらゆる動的にアロケートされるおよびアウトオブラインのストレージを含みません。

source: A unique identifier for a class instance or metatype.
ja: あるクラスインスタンスまたはメタタイプのための固有な識別子。

source: A unit of scheduleable work.
ja: 予定可能な仕事の単位。

source: A valid buffer class is non-@objc, with no declared stored properties.
ja: 有効なバッファクラスは、非@objcで、宣言された保存プロパティを持ちません。

source: A valid index of the array.
ja: この配列の有効なインデックス。

source: A valid index of the collection to use as a limit.
ja: 限度として使うためのそのコレクションの有効なインデックス。

source: A valid index of the collection.
ja: そのコレクションの有効なインデックス。

source: A value less than or equal to the number of elements in the collection.
ja: このコレクションの中の要素の数より少ないか等しい値。

source: A value less than or equal to the number of elements in the sequence, calculated nondestructively.
ja: シーケンスの要素数より少ないか等しい値、非破壊的に計算されます。

source: A value of the requested type, if present for the given key and convertible to the requested type.
ja: 要請された型の値、もし与えられたキーに対して存在して要請された型に変換可能ならば。

source: A value representative of the type to describe.
ja: 描写することになる型の典型であるある値。

source: A value stored into a subscript of a MutableCollection instance must subsequently be accessible at that same position.
ja: MutableCollectionインスタンスのある添え字へと格納される値は、その後にその同じ位置でアクセス可能でなければなりません。

source: A value that is offset from this value by n.
ja: この値からnをオフセットされる値。

source: A value that represents either a success or a failure, including an associated value in each case.
ja: 成功または失敗のどちらかを表すある値、それぞれの場合での関連値を含みます。

source: A value to compare.
ja: 比較する値。

source: A value to convert to this type of integer.
ja: この型の整数へと変換される値。

source: A value to convert to this type.
ja: この型へと変換される値。

source: A value to match against pattern.
ja: patternと照合することになるある値。

source: A value to use as the big-endian representation of the new integer.
ja: 新しい整数のビッグエンディアン表現として使う値。

source: A value to use as the little-endian representation of the new integer.
ja: 新しい整数のリトルエンディアン表現として使う値。

source: A value to use as the source of the new instance’s binary representation.
ja: 新しいインスタンスの持つバイナリ表現のソースとして使うための値。

source: A variadic list of elements of the new set.
ja: 新しい集合の要素からなる可変長引数リスト。

source: A vector formed by rounding each lane of the source vector to an integral value according to the specified rounding rule.
ja: ソースベクターの各レーンをある整数値へとこの指定された丸めruleにより丸めることによって形成されるあるベクター。

source: A vector mask with the result of a pointwise equality comparison.
ja: あるポイント単位同等比較の結果を持つベクターマスク。

source: A vector mask with the result of a pointwise greater-than comparison.
ja: ポイント単位大なり比較の結果を持つベクターマスク。

source: A vector mask with the result of a pointwise greater-than-or-equal-to comparison.
ja: ポイント単位大なり同等比較の結果を持つベクターマスク。

source: A vector mask with the result of a pointwise inequality comparison.
ja: あるポイント単位不等比較の結果をもつベクターマスク。

source: A vector mask with the result of a pointwise less-than comparison.
ja: ポイント単位小なり比較の結果を持つベクターマスク。

source: A vector mask with the result of a pointwise less-than-or-equal-to comparison.
ja: ポイント単位小なり同等比較の結果を持つベクターマスク。

source: A vector of 16 scalar values.
ja: 16スカラー値のベクター。

source: A vector of 32 scalar values.
ja: 32スカラー値のベクター。

source: A vector of 64 scalar values.
ja: 64スカラー値のベクター。

source: A vector of eight scalar values.
ja: ８つのスカラー値のベクター。

source: A vector of four scalar values.
ja: ４つのスカラー値のベクター。

source: A vector of three scalar values.
ja: ３つのスカラー値のベクター。

source: A vector of two scalar values.
ja: ２つのスカラー値のベクター。

source: A vector with one in all lanes.
ja: 全てのレーンに１つでのあるベクター。

source: A vector with the specified value in all lanes.
ja: 全てのレーンでこの指定された値を持つベクター。

source: A vector with zero in all lanes.
ja: 全てのレーンにおいてゼロをもつあるベクター。

source: A wrapper around an opaque C pointer.
ja: 不透明Cポインターの周りのラッパー。

source: Accesses a contiguous subrange of the collection’s elements.
ja: コレクションのもついくらかの要素からなるある連続した下位範囲にアクセスします。

source: Accesses the contiguous subrange of the collection’s elements specified by a range expression.
ja: 範囲式によって指定される、コレクションの要素からなる連続した下位範囲にアクセスします。

source: Accesses the element at position.
ja: positionでの要素にアクセスします。

source: Accesses the element at specified position.
ja: 指定された位置で要素にアクセスします。

source: Accesses the element at the specified index.
ja: 指定されたインデックスでの要素にアクセスします。

source: Accesses the element at the specified position.
ja: 指定された位置で要素にアクセスします。

source: Accesses the member at the given position.
ja: 与えられた位置でのメンバにアクセスします。

source: Accesses the scalar at the specified position.
ja: 指定された位置でスカラーにアクセスします。

source: Accesses the subsequence bounded by the given range.
ja: 与えられた範囲によって仕切られた下位シーケンスにアクセスします。

source: Accessing endIndex, the last property, or calling methods that depend on moving indices might not have the documented complexity.
ja: endIndex、lastプロパティにアクセスすること、または移動するインデックスに依存するメソッドを呼び出すことは、文書化される計算量を持たないかもしれません。

source: Accessing Buffer Contents
ja: バッファ内容にアクセスする

source: Accessing Elements
ja: 要素にアクセスする

source: Accessing Individual Elements
ja: 個々の要素にアクセスする

source: Accessing Underlying Storage
ja: 基礎をなすストレージにアクセスする

source: Accessing the Layout of a Type
ja: ある型のレイアウトにアクセスする

source: Accessing the Layout of a Value
ja: ある値のレイアウトにアクセスする

source: Accessing the Raw Value
ja: 生の値にアクセスする

source: Accessing this property in the case of a nil value is a serious programming error and could lead to undefined behavior or a runtime error.
ja: nil値の場合にこのプロパティにアクセスすることは、重大なプログラミングエラーです、そして未定義挙動または実行時エラーに至らせるかもしれません。

source: Add macros to your Objective-C types to group their values in Swift.
ja: マクロをあなたのObjective-C型に加えて、それらの値をSwiftにおいてグループにまとめます。

source: Adding Elements
ja: 要素の追加

source: Adding IteratorProtocol Conformance to Your Type
ja: IteratorProtocol準拠をあなたの型に加える

source: Adding New Lazy Operations
ja: 新しい遅延演算を加える

source: Adding and Removing Elements
ja: 要素の追加と削除

source: Adds an element to the end of the collection.
ja: ある要素をコレクションの終わりに加えます。

source: Adds the elements of a sequence or collection to the end of this collection.
ja: あるシーケンスまたコレクションに属するいくつかの要素をこのコレクションの終わりに加えます。

source: Adds the elements of the given set to the set.
ja: 与えられた集合の要素をこの集合に加えます。

source: Adds the given element to the option set if it is not already a member.
ja: 与えられた要素を、それがすでにメンバでないならばオプションセットに加えます。

source: Adds two values and produces their sum.
ja: ２つの値を加算してそれらの合計を生成します。

source: Adds two values and stores the result in the left-hand-side variable, wrapping any overflow.
ja: ２つの値を加算して結果を左手側の変数に格納します、あらゆるオーバーフローをラップします。

source: Adds two values and stores the result in the left-hand-side variable.
ja: ２つの値を加算して、結果を左手側の変数に格納します。

source: Adopt and interoperate with Cocoa design patterns in your Swift apps.
ja: CocoaデザインパターンをあなたのSwiftアプリにおいて採用および相互運用してください。

source: Adopting this protocol in your custom types lets you perform set-related operations such as membership tests, unions, and intersections on those types.
ja: この型をあなたのあつらえの型において採用することは、あなたにセット関連演算を行わせます、例えば、それらの型上での帰属テスト、合併、そして交叉など。

source: Advances to the next element and returns it, or nil if no next element exists.
ja: 次の要素へ進んでそれを返します、または次の要素が存在しないならばnilを返します。

source: After You Finish
ja: あなたがやり終えたあと

source: After applying the macro, the name you use in your Swift code will be what you've chosen by using the macro.
ja: このマクロを適用後、あなたのSwiftコードにおいてあなたが使う名前は、あなたがマクロを使うことにで選択したものになります。

source: After partitioning a collection, there is a pivot index p where no element before p satisfies the belongsInSecondPartition predicate and every element at or after p satisfies belongsInSecondPartition.
ja: コレクションを仕切った後、あるピボットインデックスpがあります、そこでpの前の要素は１つもbelongsInSecondPartition述部を満たさず、そしてpでのまたは後のあらゆる要素はbelongsInSecondPartitionを満たします。

source: After some time of inactivity, the user’s session may expire, leaving the app in a session expired state.
ja: しばらく活動がない後に、ユーザのセッションは期限切れになるかもしれません、アプリを期限切れセッションの状態のままにします。

source: After the user has registered or logged into an account, the state is logged in.
ja: ユーザがアカウントに登録またはログインした後は、状態はログイン済みです。

source: After using firstIndex(of:) to find the position of a particular element in a collection, you can use it to access the element by subscripting.
ja: firstIndex(of:)を使って特定の要素の位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: After using lastIndex(of:) to find the position of the last instance of a particular element in a collection, you can use it to access the element by subscripting.
ja: lastIndex(of:)を使って特定の要素の最後のインスタンスの位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: All elements satisfying this predicate are ordered after all elements not satisfying it.
ja: この述部を満たす全ての要素は、それを満たさない全ての要素の後に並べられます。

source: All other object instances are annotated as nonnull.
ja: 全ての他のオブジェクトインスタンスは、nonnullであると注釈を付けられます。

source: All the elements following the specified position are moved to close the gap.
ja: 指定された位置に続く要素すべては、隙間を埋めるように移動されます。

source: All the keys the Decoder has for this container.
ja: Decoderがこのコンテナに対して持っている全てのキー。

source: All the keys the decoder has for this container.
ja: デコーダがこのコンテナに対して持っている全てのキー。

source: Alternatively, a predicate can be satisfied by a range of Equatable elements or a general condition.
ja: あるいは、述部は、Equatable要素のある範囲またはある一般的条件によって満たされることができます。

source: Alternatively, if your type can act as its own iterator, implementing the requirements of the IteratorProtocol protocol and declaring conformance to both Sequence and IteratorProtocol are sufficient.
ja: あるいはまた、あなたの型がそれ自身イテレータとして振る舞うならば、IteratorProtocolプロトコルの要件を実装することとSequenceおよびIteratorProtocolの両方に対する準拠を宣言することで十分です。

source: Alternatively, to create an option set instance with multiple members, assign an array literal with multiple static members of the option set.
ja: あるいはまた、複数のメンバをもつ１つのオプションセットインスタンスを作成するには、オプションセットの複数の静的メンバをもつ配列リテラルを割り当ててください。

source: Alternatively, use this method to sort a collection of elements that do conform to Comparable when you want the sort to be descending instead of ascending.
ja: そうではなくて、あなたが昇順ではなく降順でソートしたい場合は、このメソッドを使ってComparableに準拠する要素からなるコレクションをソートしてください。

source: Although .express is not a member of options, .express subsumes the remaining .secondDay element of the option set.
ja: とは言え.expressはoptionsのメンバではありません、しかし.expressはこのオプションセットの残りの要素.secondDayを包含します。

source: Although an actual dictionary is arbitrarily-ordered, when you create a mirror with a dictionary literal, the ordering of the mirror’s children will exactly match that of the literal you pass.
ja: actual辞書は気まぐれに順番付けられますが、あなたがミラーを辞書リテラルで作成する時、ミラーの持つchildrenの順番付けは正確にあなたが渡すリテラルのそれと一致します。

source: Always use a multiple of a type’s stride instead of its size when allocating memory or accounting for the distance between instances in memory.
ja: メモリをアロケートするまたはメモリ中のインスタンス間の隔たりを計上する場合には、常にある型のもつstrideの倍数を使ってください、それのsizeではなく。

source: Always use the slice’s startIndex property instead of assuming that its indices start at a particular value.
ja: 常にスライスのstartIndexプロパティを使ってください、それのインデックスが特定の値で始まると決めてかかるのではなく。

source: An 8-bit signed integer value type.
ja: 8ビット符号つき整数値型。

source: An array containing the elements of this sequence in reverse order.
ja: このシーケンスの要素を逆順に含んでいる配列。

source: An array containing the transformed elements of this sequence.
ja: このシーケンスの変換済み要素を含んでいる配列。

source: An array of subsequences, split from this collection’s elements.
ja: このコレクションの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of subsequences, split from this sequence’s elements.
ja: このシーケンスの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of the elements that isIncluded allowed.
ja: isIncludedが許可する要素からなる配列。

source: An array of the non-nil results of calling transform with each element of the sequence.
ja: シーケンスの各要素でtransformを呼ぶことの非nilの結果の配列。

source: An array of this sequence’s elements in a shuffled order.
ja: このシーケンスの持つ要素からなる配列、シャッフルされた順番で。

source: An element equal to newMember if the set already contained such a member; otherwise, nil.
ja: 集合がすでにそのようなメンバを含んでいるならば、newMemberに等しい要素；そうでなければ、nil。

source: An element of the reflected instance’s structure.
ja: リフレクションされる（自己言及、自己参照の対象の）インスタンスの持つ構造体の中のある要素。

source: An element to insert into the set.
ja: この集合に挿入されることになる要素。

source: An element to look for in the set.
ja: 集合において捜される要素。

source: An element to search for in the collection.
ja: このコレクションにおいて捜される要素。

source: An element to search for in the set.
ja: この集合において捜される要素。

source: An empty Range instance has equal lower and upper bounds.
ja: 空のRangeインスタンスは、等しい下方および上方境界を持ちます。

source: An enumeration of the elements of a sequence or collection.
ja: シーケンスまたはコレクションの要素の列挙。

source: An equivalent range must be representable as an instance of Range<Bound>.
ja: 同等の範囲が、Range<Bound>のインスタンスとして表現可能でなければなりません。

source: An implementation detail of key path expressions; do not use this protocol directly.
ja: キーパス式の実装詳細；このプロトコルを直接に使わないでください。

source: An index offset by distance from the index i, unless that index would be beyond limit in the direction of movement.
ja: distanceだけインデックスiから補われたインデックス、そのインデックスがlimitを移動方向において越える場合を除きます。

source: An index offset by distance from the index i.
ja: distanceだけインデックスiから補われるインデックス。

source: An index that traverses the same positions as an underlying index, with inverted traversal direction.
ja: ある基礎をなすインデックスが指すのと同じ幾つかの位置を、逆の走査順で辿っていくインデックス。

source: An instance of a class.
ja: あるクラスのインスタンス。

source: An instance representing the state of the receiver with the difference applied, or nil if the difference is incompatible with the receiver’s state.
ja: 適用された差異をもつレシーバの状態を表しているインスタンス、またはnil、もし差異がレシーバのもつ状態と相容れないならば。

source: An instance that is expressed as a literal can also be used with this operator.
ja: リテラルとして表されるインスタンスはまた、この演算子とともに使われることができます。

source: An integer to compare.
ja: 比較する整数。

source: An integer to convert to this type.
ja: この型へと変換する整数。

source: An integer type that can represent both positive and negative values.
ja: 正および負の値の両方を表すことができる整数型。

source: An integer type that can represent only nonnegative values.
ja: 非負値だけを表すことができる整数型。

source: An integer type that uses a fixed size for every instance.
ja: あらゆるインスタンスに対して固定された大きさを使う整数型。

source: An integer type with a binary representation.
ja: バイナリ表現での整数型。

source: An integer value.
ja: ある整数値。

source: An interval from a lower bound up to, and including, an upper bound.
ja: 下側の境界から、上側の境界までの、そしてそれを含む、間隔。

source: An iterator for a StrideThrough instance.
ja: StrideThroughインスタンスのためのイテレータ。

source: An iterator for a StrideTo instance.
ja: StrideToインスタンスのためのイテレータ。

source: An iterator over the elements traversed by a base iterator that follow the initial consecutive elements that satisfy a given predicate.
ja: ある基盤イテレータによって辿られる要素で、与えられた述部を満足させる最初の連続した要素に続くものすべてを対象とするイテレータ。

source: An iterator over the elements traversed by some base iterator that also satisfy a given predicate.
ja: 何らかの基盤イテレータによって辿られるいくらかの要素でさらにまた与えられた述部を満足させるものを対象とするイテレータ。

source: An iterator over the initial elements traversed by a base iterator that satisfy a given predicate.
ja: ある基盤イテレータによって辿られるもので、与えられた述部を満足させる最初の要素らを対象とするイテレータ。

source: An iterator over the members of a Set<Element>.
ja: Set<Element>のメンバーすべてを対象とするイテレータ。

source: An iterator that presents the elements of the sequences traversed by a base iterator, concatenated using a given separator.
ja: あるイテレータ、それは基盤イテレータによって辿っていかれるいくらかのシーケンスに属する要素らを、与えられた分離子を使って連結して提示します。

source: An object representing a dynamic, unordered, uniquing collection, for use instead of a Set variable in cases that require reference semantics.
ja: 動的な、順序なしの、特有なコレクションを表しているオブジェクト、参照意味論を必要とする場合にSet変数の代わりに使うため。

source: An object representing a static, unordered, uniquing collection, for use instead of a Set constant in cases that require reference semantics.
ja: 静的な、順序なしの、特有なコレクションを表しているオブジェクト、参照意味論を必要とする場合にSet定数の代わりに使うため。

source: An option set.
ja: あるオプションセット。

source: An optional value to compare.
ja: 比較することになるオプショナル値

source: An ordered, random-access collection.
ja: 順序付けられた、無作為アクセスのコレクション。

source: An overshift results in -1 for a negative value of lhs or 0 for a nonnegative value.
ja: オーバーシフトは、負の値のlhsに対して-1または非負値に対して0という結果になります。

source: An unkeyed decoding container view into self.
ja: selfへのキー無しデコーディングコンテナビュー。

source: An unordered collection of unique elements.
ja: 特有な要素いくつかからなるある順番付けられないコレクション。

source: An unowned reference to a serial executor (a SerialExecutor value).
ja: ある直列遂行者（シリアルエグゼキュータ）への非所有参照（SerialExecutor値）。

source: An unsigned 64-bit random value.
ja: 符号なし64ビット無作為値。

source: Annotate Nullability of Individual Declarations
ja: 個々の宣言のヌル可能性に注釈を付ける

source: Annotate Regions as Nonnullable
ja: 領域に非ヌル可能性として注釈を付ける

source: Annotate property declarations, parameter types, and return types that are simple objects or block pointers using the nullable, nonnull, and null_resettable property attributes.
ja: プロパティ宣言、パラメータ型、そして戻り値で、nullable、nonnull、そしてnull_resettableプロパティ属性を使っている単純なオブジェクトまたはブロックパラメータであるものに注釈を付けてください。

source: Another integer to compare.
ja: 比較するもう一方の整数。

source: Another integer value.
ja: もう１つの整数値。

source: Another optional value to compare.
ja: もう一方の比較するオプショナル値。

source: Another range to compare.
ja: もう一方の比較する範囲。

source: Another range-replaceable collection.
ja: もう一方の範囲置換可能なコレクション。

source: Another set.
ja: もう一方の集合。

source: Another valid index of the collection.
ja: コレクションの別の有効なインデックス。

source: Another value to compare.
ja: もう一方の比較する値。

source: Any fractional part of the value passed as source is removed, rounding the value toward zero.
ja: sourceとして渡される値の小数部分は何であれ取り除かれます、値はゼロへと丸められます。

source: Any fractional part of the value passed as source is removed.
ja: sourceとして渡される値の小数部分は何であれ取り除かれます。

source: Any remaining mirror path components.
ja: あらゆる残りのミラーパス構成要素。

source: Appends the elements of a sequence to a range-replaceable collection.
ja: あるシーケンスの要素を範囲置換コレクションに加えます。

source: Applies the given difference to this collection.
ja: 与えられた差異をこのコレクションに適用します。

source: Apply CF_SWIFT_NAME to Related Functions
ja: CF_SWIFT_NAMEを関連した関数に適用する

source: Apply macros to your Objective-C APIs to customize how they're imported into Swift.
ja: マクロをあなたのObjective-C APIに適用して、それらがSwiftにインポートされる方法をカスタマイズします。

source: Applying AppKit Graphic Operations
ja: AppKitグラフィック演算子を適用する

source: Applying the NS_REFINED_FOR_SWIFT macro exposes the existing Objective-C API for reuse in your refined API.
ja: NS_REFINED_FOR_SWIFTマクロを適用することは、既存のObjective-C APIを、あなたの改良されたAPIにおいて再利用するために公開します。

source: As You Work
ja: あなたが作業するとき

source: As a consequence, don’t assume that multiple for-in loops on a sequence will either resume iteration or restart from the beginning:
ja: 結果として、あるシーケンス上での複数のfor-inループが反復を途中から再開するかまたは初めから再度着手するか、どちらかを決めてかからないでください：

source: As a result, you can chain multiple ?? operators together.
ja: 結果として、あなたは複数の??を一緒に鎖状につなげることができます。

source: As an example, to check whether a sequence includes a particular value, you can test each value sequentially until you’ve found a match or reached the end of the sequence.
ja: １つの例として、あるシーケンスが特定の値を含むかどうか確認するために、あなたは各値を順次テストすることが、あなたが一致するものを見つけるかそのシーケンスの終わりに達するまで行えます。

source: As soon as the sequence has run out of elements, all subsequent calls return nil.
ja: シーケンスが要素を使い果たすやいなや、全てのその後の呼び出しはnilを返します。

source: As such, it should be possible to re-create an instance from its string representation.
ja: それなので、それはそれの文字列表現からインスタンスの再度作成が可能であるべきです。

source: As you work with Objective-C APIs, you’ll need to know how Swift translates certain Objective-C language features.
ja: あなたがObjective-C APIを扱うとき、あなたはスウィフトがどのように特定のObjective-C言語機能を翻訳するか知っている必要があります。

source: Associated Types
ja: さまざまな関連型

source: Assume that S is a custom type that conforms to the SetAlgebra protocol, x and y are instances of S, and e is of type S.Element—the type that the set holds.
ja: SはSetAlgebraプロトコルに準拠するあつらえの型、xとyはSのインスタンス、そしてeは型S.Element — 集合が保持する型、と仮定します。

source: At least one of the sequences must be finite.
ja: 少なくともシーケンスのうちの一方は有限でなければなりません。

source: Attempting to access an element by using an index outside the bounds of the slice may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to access an element by using an index outside the bounds of the slice’s indices may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスのもつインデックスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to call the collectionWithValues:forKeys: method in Swift results in a compiler error.
ja: collectionWithValues:forKeys:メソッドをスウィフトにおいて呼び出す試みは、コンパイラエラーという結果になります。

source: Attempting to remove more elements than exist in the collection triggers a runtime error.
ja: コレクションの中に存在するより多くの要素の削除を試みることは実行時エラーの引き金となります。

source: Attempting to remove the same shipping option a second time results in nil, because options no longer contains .priority as a member.
ja: 同じ出荷オプションの削除を２回目に試みることはnilという結果になります、optionsはもはや.priorityをメンバとして含まないからです。

source: Available when ArrayLiteralElement is Element.
ja: ArrayLiteralElementがElementである時に利用可能です。

source: Available when Element conforms to Comparable.
ja: ElementがComparableに準拠する時に利用可能です。

source: Available when Element conforms to Equatable.
ja: ElementがEquatableに準拠する時に利用可能です。

source: Available when Element conforms to Sequence.
ja: ElementがSequenceに準拠する時に利用可能です。

source: Available when Element conforms to StringProtocol.
ja: ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Element is (CGRect, NSColor).
ja: Elementが(CGRect, NSColor)である時に利用可能です。

source: Available when Element is (CGRect, gray: CGFloat).
ja: Elementが(CGRect, gray: CGFloat)である時に利用可能です。

source: Available when Element is NSRect.
ja: ElementがNSRectである時に利用可能です。

source: Available when Element is String.
ja: ElementがStringである時に利用可能です。

source: Available when Elements conforms to LazyCollectionProtocol.
ja: ElementsがLazyCollectionProtocolに準拠する時に利用可能です。

source: Available when Elements conforms to LazySequenceProtocol.
ja: ElementsがLazySequenceProtocolに準拠する時に利用可能です。
